# 51: Seleksi baris dengan between()

### Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  9  3  3  2  5
1  5  8  9  9  8
2  6  5  4  8  4
3  7  5  6  5  5
4  6  5  7  4  9
5  8  3  7  2  9
6  1  5  7  5  5
7  4  3  2  2  9
8  8  3  2  5  2
9  3  4  6  8  2

### Seleksi baris dengan between()

In [3]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
1  5  8  9  9  8
7  4  3  2  2  9
9  3  4  6  8  2

In [4]:
df[df['A'].between(2, 5, inclusive=False)]

C:\Users\JD.ID\AppData\Local\Temp/ipykernel_32416/2550752053.py:1: FutureWarning: Boolean inputs to the `inclusive` argument are deprecated infavour of `both` or `neither`.
  df[df['A'].between(2, 5, inclusive=False)]

   A  B  C  D  E
7  4  3  2  2  9
9  3  4  6  8  2